Revit 2027 API
BuiltInFailures.ReshapeFromFacetsFailures.ReshapeFromFacetsFailed Property
 Reshape from facets failed. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReshapeFromFacetsFailed { get; }
Public Shared ReadOnly Property ReshapeFromFacetsFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReshapeFromFacetsFailed {
	FailureDefinitionId^ get ();
}
static member ReshapeFromFacetsFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ReshapeFromFacetsFailures Class
Autodesk.Revit.DB Namespace